function length=stewart()
%进行运动学逆解的代码编写
qref=[2 3 4 55 60 60];
%qref=[3.1 -3.1 3.1 3.1 -3.1 3.1];
a=qref(4);b=qref(5)/180*pi;c=qref(6)/180*pi;
rx=[1 0 0;0 cos(a/180*pi) -sin(a/180*pi);0 sin(a/180*pi) cos(a/180*pi)];
ry=[cos(b) 0 sin(b);0 1 0;-sin(b) 0 cos(b)];
rz=[cos(c) -sin(c) 0;sin(c) cos(c) 0;0 0 1];
rab=rz*ry*rx;
%平台的参数设置,其中b代表的是下平台的参数，p代表是上平台的参数
%b=[ -164.2  -147.2  120.2  147.2 44  0;
      %44      85    120.2  85  -164.2 -170 ;
         %0      0       0        0        0       0];
%p=[ -106.3    -46.3   -3.8   123.7   110.1       -77.4; 
     %-65.8    116.1    125     -18  -59.2  -98.2 ;
       %0     0       0       0        0       0];
b=[ 296.65  31.47  -31.47  -296.65  -265.18  265.18;
   -134.93 324.47  324.47  -134.93  -189.44 -189.44 ;
         0      0       0        0        0       0];
p=[ 112.47    92.47   -92.47   -112.47   -20       20; 
     41.84    76.48    76.48     41.84  -118.32  -118.32 ;
       0     0       0       0        0       0];
%参数初始空间
%lmin=569.00;
%lmax=800.00;
%setamax=70;
%zmin=450;
%zmax=1000;
for i=1:6
    bp=rab*p(:,i)+qref(1:3)'-b(:,i);
    sizebp=size(bp,1);
    sumlength=0;
    for j=1:sizebp
        sumlength=sumlength+bp(j)^2;
    end
    length(i)=sumlength^0.5;
end
end